# 10172. 예제와 같이 개를 출력하시오.
# |\_/|
# |q p|   /}
# ( 0 )"""\
# |"^"`    |
# ||_/=\\__|
print("|\\_/|")
print("|q p|   /}")
print("( 0 )\"\"\"\\")
print("|\"^\"`    |")
print("||_/=\\\__|")

#1000. 두 정수 A와 B를 입력받은 다음, A+B를 출력하는 프로그램을 작성하시오.
# 첫째 줄에 A와 B가 주어진다. (0<A, B<10)
# 첫째 줄에 A+B를 출력한다.
a,b = input().split()
a = int(a)
b = int(b)
print(a+b)
# split() : 입력 받은 두 수를 나누어주기

#1001. 두 정수 A와 B를 입력받은 다음, A-B를 출력하는 프로그램을 작성하시오.
# 첫째 줄에 A와 B가 주어진다. (0 < A, B < 10)
# 첫째 줄에 A-B를 출력한다.
a,b = input().split()
print(int(a)-int(b))
